pintoXD/stm32wb55LoRaFuota/Projects/STM32H750B-DK/Applications/2_Images_ExtFlash/2_Images_UserApp/Src/fw_update_app.c
/**
  ******************************************************************************
  * @file    fw_update_app.c
  * @author  MCD Application Team
  * @brief   Firmware Update module.
  *          This file provides set of firmware functions to manage Firmware
  *          Update functionalities.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2017 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under Ultimate Liberty license
  * SLA0044, the "License"; You may not use this file except in compliance with
  * the License. You may obtain a copy of the License at:
  *                             www.st.com/SLA0044
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/

#include "se_def.h"
#include "com.h"
#include "common.h"
#include "flash_if.h"
#include "stm32h7xx_hal.h"
#include "stm32h750b_discovery.h"
#include "fw_update_app.h"
#include "se_interface_application.h"
#include "sfu_fwimg_regions.h"
#include "sfu_standalone_loader.h"
#include "sfu_app_new_image.h"
#include "string.h"
#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
#include "mapping_fwimg.h"
#include "mapping_sbsfu.h"
#elif defined (__ICCARM__) || defined(__GNUC__)
#include "mapping_export.h"
#endif /* __CC_ARM || __ARMCC_VERSION */
#include "ymodem.h"

/* Private defines -----------------------------------------------------------*/

#define EXTERNAL_LOADER                /* In this example, external loader is activated in the default configuration */
#define ALL_SLOTS 255U                   /*!< Validate all new firmware installed in a single request */
/* Global variables ----------------------------------------------------------*/

#if !defined(EXTERNAL_LOADER)
static uint32_t m_uFileSizeYmodem = 0U;  /*!< Ymodem File size*/
static uint32_t m_uNbrBlocksYmodem = 0U; /*!< Ymodem Number of blocks*/
static uint32_t m_uPacketsReceived = 0U; /*!< Ymodem packets received*/

#ifdef MINICOM_YMODEM
/*
 * With Minicom Ymodem, the data offset is not aligned because PACKET_DATA_INDEX is 7
 * So we cannot write in FLASH with pData as source, we need a copy in an aligned buffer
 */
/* With Minicom YMODEM each packet carries 128 bytes of data */
static uint8_t alignedBuffer[PACKET_SIZE] __attribute__((aligned(8)));
#endif /* MINICOM_YMODEM */
#endif /* !EXTERNAL_LOADER */

/* Private function prototypes -----------------------------------------------*/

#if !defined(EXTERNAL_LOADER)
static HAL_StatusTypeDef FW_UPDATE_DownloadNewFirmware(SFU_FwImageFlashTypeDef *pFwImageDwlArea);
#endif /* !EXTERNAL_LOADER */

/* Functions Definition ------------------------------------------------------*/

/**
  * @brief  Run FW Update process.
  * @param  None
  * @retval HAL Status.
  */
#if defined(EXTERNAL_LOADER)
void FW_UPDATE_Run(void)
{
  uint32_t source, source_end;
  typedef  void (*pFunction)(void);
  pFunction JumpToApplication;
  uint32_t *dest;

  printf("\r\n============== Move Loader to SRAM =======================\r\n");

  /* Disable Systick interrupt */
  SysTick->CTRL = 0;

  /* Copy App Loader code to SRAM */
  source = (uint32_t)APP_LOADER_REGION_ROM_START;
  source_end = (uint32_t)APP_LOADER_REGION_ROM_END;
  dest = (uint32_t *)APP_LOADER_REGION_RAM_CODE_START;
  while (source < source_end)
  {
      *dest = *(__IO uint32_t *)source;
      dest++;
      source += 4U;
  }

  /* Print Firmware Update welcome message */
  printf("\r\n================ New Fw Download =========================\r\n\n");

  /* Initialize user application's Stack Pointer & Jump to user application */
  JumpToApplication = (pFunction) (*(__IO uint32_t*) (APP_LOADER_REGION_RAM_CODE_START + 4));
  __set_MSP(*(__IO uint32_t*) APP_LOADER_REGION_RAM_CODE_START);
  JumpToApplication();

  /* We should never get here as execution is now on loader moved to SRAM */
  while(1)
  {
  }
}

#else
void FW_UPDATE_Run(void)
{
  HAL_StatusTypeDef ret = HAL_ERROR;
  uint8_t  fw_header_dwl_slot[SE_FW_HEADER_TOT_LEN];
  SFU_FwImageFlashTypeDef fw_image_dwl_area;

  /* Print Firmware Update welcome message */
  printf("\r\n================ New Fw Download =========================\r\n\n");

  /* Get Info about the download area */
  SFU_APP_GetDownloadAreaInfo(SLOT_DWL_1, &fw_image_dwl_area);

  /* Download new firmware image*/
  ret = FW_UPDATE_DownloadNewFirmware(&fw_image_dwl_area);

  if (HAL_OK == ret)
  {
    /* Read header in dwl slot */
    (void)FLASH_If_Read(fw_header_dwl_slot, (void *) fw_image_dwl_area.DownloadAddr, SE_FW_HEADER_TOT_LEN);

    /* Ask for installation at next reset */
    (void)SFU_APP_InstallAtNextReset((uint8_t *) fw_header_dwl_slot);

    /* System Reboot*/
    printf("  -- Image correctly downloaded - reboot\r\n\n");
    HAL_Delay(1000U);
    NVIC_SystemReset();
  }

  if (ret != HAL_OK)
  {
    printf("  -- !!Operation failed!! \r\n\n");
  }
}
#endif /* EXTERNAL_LOADER */


#if defined(EXTERNAL_LOADER)
/**
  * @brief  Run Multiple FW Update process.
  * @param  None
  * @retval None.
  */
void FW_UPDATE_MULTIPLE_RunMenu(void)
{
  printf("  Feature not supported ! \r\n");
}

#else
/**
  * @brief  Print Multiple FW Update menu.
  * @param  None
  * @retval HAL Status.
  */
static void FW_UPDATE_MULTIPLE_PrintMenu(void)
{
  /* Print Multiple Download menu */
  printf("\r\n============= Multiple Download Menu ================\r\n\n");
  printf("  Download firmware in DWL_SLOT #1 ---------------------- 1\r\n\n");
  printf("  Download firmware in DWL_SLOT #2 ---------------------- 2\r\n\n");
  printf("  Download firmware in DWL_SLOT #3 ---------------------- 3\r\n\n");
  printf("  Start installation ------------------------------------ 4\r\n\n");
  printf("  Previous Menu ----------------------------------------- x\r\n\n");
  printf("  Selection :\r\n\n");
}

/**
  * @brief  Run Multiple FW Update process.
  * @param  None
  * @retval None.
  */
void FW_UPDATE_MULTIPLE_RunMenu(void)
{
  SFU_FwImageFlashTypeDef fw_image_dwl_area;
  uint8_t key = 0U;
  uint32_t exit = 0U;
  uint32_t i = 0U;
  uint32_t several_dwl_area = 1U;
  uint32_t slot_number = 0U;
  static  uint8_t fw_to_install = 0U;
  uint8_t  fw_header_dwl_slot[SE_FW_HEADER_TOT_LEN];

  /* Print Menu */
  FW_UPDATE_MULTIPLE_PrintMenu();

  /* Verify if at least 2 DWL areas exist */
  for (i = 1U; i < SFU_NB_MAX_DWL_AREA; i++)
  {
    if (SlotStartAdd[SLOT_DWL_1 + i] != 0U)
    {
      several_dwl_area++;
    }
  }

  if (several_dwl_area == 1)
  {
    printf("  -- !!Only 1 download area configured - feature not available!! \r\n\n");
    return;
  }

